app/Http/Controllers/CategoriesController.php

select * from `topics` where `category_id` = '1' order by `updated_at` desc limit 20 offset 0
select count(*) as aggregate from `topics` where `category_id` = '1'
---
    public function show(Category $category)
    {
        // 读取分类 ID 关联的话题，并按每 20 条分页
        $topics = Topic::where('category_id',$category->id)->paginate(20);