app/Http/Controllers/TopicsController.php

select * from `categories` where `categories`.`id` in ('1', '2', '3', '4')
select * from `topics` order by `updated_at` desc limit 20 offset 0
select * from `users` where `users`.`id` in ('1', '2', '3', '4', '5', '6', '7', '8', '9', '10')
select count(*) as aggregate from `topics`
---
	public function index()
	{
		$topics = Topic::with('user','category')->paginate();